---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNdfType
source: html/67be5463-3504-076e-4280-a36eaa1d0b1e.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNdfType Property

The property labeled "NDF" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".